# NewGutter Method (GutterType, Reference) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewGutter Method (GutterType, Reference)
Document Class See Also
---
Creates a gutter along a reference.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Gutter NewGutter(
	GutterType GutterType,
	Reference reference
)
```

Visual Basic
---
```text
Public Function NewGutter ( _
	GutterType As GutterType, _
	reference As Reference _
) As Gutter
```

Visual C++
---
```text
public:
Gutter^ NewGutter(
	GutterType^ GutterType,
	Reference^ reference
)
```

# ### Parameters
GutterType
    Type: Autodesk.Revit.DB.Architecture..::..GutterType The type of the gutter to create
reference
    Type: Autodesk.Revit.DB..::..Reference A planar line or arc that represents the place where you want to place the gutter.
# ### Return Value
If successful a new gutter object within the project, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the gutter type does not exist in the given document. |

# See Also
Document Class
NewGutter Overload
Autodesk.Revit.Creation Namespace